---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1NoSpacing
source: html/4fe52f90-4f53-4f46-c96b-563593ab6ea8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemLayerSummaryTopDir1NoSpacing Property

"Top/Exterior Major (Brief)"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemLayerSummaryTopDir1NoSpacing { get; }
```